{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "input_dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": [], "name": "input_17"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "input_dtype": "float32", "sparse": false, "name": "input_18"}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_2", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 10000, "batch_input_shape": [null, 10], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 10}, "inbound_nodes": [[["input_17", 0, 0]], [["input_18", 0, 0]]], "name": "embedding_2"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_9", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "sigmoid", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 300, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["embedding_2", 0, 0]], [["embedding_2", 1, 0]]], "name": "lstm_9"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lstm_9", 0, 0], ["lstm_9", 1, 0]]], "name": "merge_8"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_15", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 16}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "dense_15"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_16", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 16, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dense_15", 0, 0]]], "name": "dense_16"}], "input_layers": [["input_17", 0, 0], ["input_18", 0, 0]], "output_layers": [["dense_16", 0, 0]], "name": "model_8"}}